trade_exp/src/Documents/РейсСиламиПоставщика/РейсСиламиПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5bf82e73-7ab1-45bf-b862-fb5b6c6a88ca">
  <name>РейсСиламиПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="44cf9367-fa27-43f2-b5f6-e865a768535a">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6855db2e-fadc-4931-b26d-d3babf2b2386">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1bb483f1-bda5-4cff-b3ae-2eeccc5ed72d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7f6f4ed0-3c87-42ca-a340-824eee881375">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="499f89e5-e247-4cbb-b287-4669a9057932">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4673add5-4f59-49b3-8d5a-d1b552b2ba5c">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dd91057b-9750-4fa2-9f1e-07221568bf73">
    <name>СтоимостьТовара</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="426b44a6-144f-4e89-9b57-dd42e205630b">
    <name>КоличествоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7ca02de9-ea5f-4df1-b33d-2fc0cabb7003">
    <name>НачалоВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="65fb697b-d091-4d48-b593-804e3fc80c0f">
    <name>ДатаПрибытияНаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8f4d143e-213c-4531-a3ad-d309ec58f76f">
    <name>Стоимость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="861bc191-79f7-43af-bc3b-24a0dabad2b4">
    <name>Основания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="aeb236a5-5252-4a35-b0fe-696c9738d591">
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="308a66c9-8640-4f0b-9dd4-b9e234772248">
      <name>Приобретение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="46f06fe2-991f-415b-9d3d-5013cc43a9c8">
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1c493b73-b173-4b6d-8a15-dec6117f8348">
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="1683c530-8a9f-46e3-a41d-432431d33d9a">
    <name>ГруппаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0f81bb31-85fa-43a9-975e-7162ecf07fd8">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a8540aa-05a4-46e1-8b0e-6c5864426864">
      <name>Норматив</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a745065e-2078-4b3f-9b56-0041d5f058b6">
      <name>Секция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="127d2c69-2fff-4ee8-9767-5dc1330559c2">
      <name>ПримечаниеКПоставке</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1cc74222-9dc5-4cc2-a2f6-577b578a2156">
      <name>ДатаРазгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ffc9b0cc-ff47-428a-8153-7ce570c7f5e2">
      <name>ВремяПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cf668fdf-759b-473c-907b-0c3a442b3258">
      <name>ПродолжительностьРазгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cbfc4f32-a1bf-4bc0-969a-844b394d6867">
      <name>СогласованоСоСкладом</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5928b091-ea44-4c40-9d87-187b639263db">
      <name>ОбъемПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="866ad587-5e51-4ddd-b4c1-46cceb9fa793">
      <name>ВесПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aeeb67df-2c2d-43ef-b0c7-c7a48082aed6">
      <name>ФактическоеВремяПрибытия</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b60c94bd-5be6-4593-b46e-39c67a4ce415">
      <name>НачалоПогрузкиКПП</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2e4bd777-95a7-460c-aa48-fda63308380a">
      <name>ОкончаниеПогрузкиКПП</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9909c50-ebe2-4815-b32e-e021003a12b7">
      <name>Эстакада</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ГрафикПоставокНаСклад/ГрафикПоставокНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b705356a-3674-4009-9b19-325f4f8d31b5">
  <name>ГрафикПоставокНаСклад</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="76b53ffb-1cb8-4f02-8672-d6fb75f950f8">
    <name>Поток</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="7d8d9c96-2e82-42e6-9eaa-77e664a95aa0">
    <name>ДатаВремяРазгрузкиПлан</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="554d2043-23c2-4d8a-8d1f-7673b049aace">
    <name>ПродолжительностьРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="26c907b0-a3c4-480d-b8cf-9e1a032a4aea">
    <name>ДатаВремяПриездаФакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b09375dc-860d-4367-bc6f-b6ac98e85b4a">
    <name>КоличествоИспользуется</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="2e92b9a3-164e-497a-a5c9-88c89460f830">
    <name>АвторИзменений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dcbd2790-7240-447e-8d1d-bbebc3396ef2">
    <name>СогласованоСоСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4a7ccbc1-15a7-4f8d-a54f-41f83a07c417">
    <name>ТекстПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="4e117ade-5a52-4e6e-9ee4-f1a871bf22bd">
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c96af1ba-579e-4dd9-8e21-ed2ba80d3cad">
    <name>Оборудование</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ТипыИзмеряемыхВеличин/ТипыИзмеряемыхВеличин.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыИзмеряемыхВеличин</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="39bca12a-73d8-4f63-b175-8d09e27f1889">
    <name>Энергия</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9fe5bd6a-0dc3-492a-8124-5d8374b7dc0f">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="166d8d12-5edc-4ab3-859d-fbfc26f1f783">
    <name>КоличествоШтук</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="03b65f12-3868-4b16-a177-ed2ec292ca2c">
    <name>Площадь</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ae31522b-14d7-4a69-9cc9-ccad6a27391d">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="654bd14d-c881-4925-beea-5643856794e3">
    <name>Длина</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="63b8d3ae-e98a-46bc-9820-21ca637b2ea5">
    <name>ЭлектрическийЗаряд</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="755c3036-63aa-4cd7-bb48-ea6719b0f5f1">
    <name>Мощность</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="99ce385b-b097-477a-9cb5-30caba0dd9e5">
    <name>Время</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ПотокиТранспортныхСредствПоставкиНаСклад/ПотокиТранспортныхСредствПоставкиНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="735c9797-25e5-44eb-8f8a-1633c6be5ce1">
  <name>ПотокиТранспортныхСредствПоставкиНаСклад</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3c2491b2-2a6c-4b6c-a71a-05c1ee467c74">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3cc493c5-f400-4b1b-a013-3158d1b54643">
    <name>ПотокАктивный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="1edd5cde-e02e-4d4c-8065-0c671bbd8ff7">
    <name>Секции</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="203168ef-32cb-4993-9d9d-f84699c6dd7a">
      <name>Секция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Documents/РейсСиламиПоставщика/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Заполнение
Процедура ЗаполнитьДанныеПоОснованию(Основания, Объект)Экспорт
	Если Не ЗначениеЗаполнено(Основания) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Основания) = Тип("Массив") Тогда
		мОснований= Основания;
	Иначе
		мОснований= Новый Массив;
		мОснований.Добавить(Основания);
	КонецЕсли;
	
	ЗаказыИПриобретения = ПолучитьСписокЗаказовПоставщикуИПриобретений(мОснований);
	
	//Вставить проверку и сообщение, что у заказа нет приобретения
	Для каждого Заказ из мОснований Цикл
		Если ЗаказыИПриобретения.НайтиСтроки(Новый Структура("ЗаказПоставщику", Заказ)).Количество() = 0 Тогда
			Сообщить("Для документа "+Строка(Заказ)+" не создано приобретение. Заказ не будет добавлен в рейс");
		КонецЕсли;
	КонецЦикла;
	
	//Вставить проверку и сообщение, что заказ и приобретение уже присутствует в другом рейсе
	ПроверитьНаличиеЗаказаВДругихРейсах(мОснований, ЗаказыИПриобретения);
	
	//Вставить проверку на время КПП и наличие приходного ордера
	ПроверитьПроездКПП(мОснований, ЗаказыИПриобретения);
	ПроверитьНаличиеПриходногоОрдера(мОснований, ЗаказыИПриобретения);
	
	Попытка
		ИтогВес = 0; ИтогОбъем = 0;
		
		Для каждого Строка из ЗаказыИПриобретения Цикл
			СтрокаТЧ = Объект.Основания.Добавить();
			СтрокаТЧ.Документ = Строка.ЗаказПоставщику;
			СтрокаТЧ.Приобретение = Строка.Приобретение;
			СтрокаТЧ.Вес = Строка.Вес;
			СтрокаТЧ.Объем = Строка.Объем;
			ИтогВес = ИтогВес+Строка.Вес;
			ИтогОбъем = ИтогОбъем+Строка.Объем;
			Стоимость = Строка.Приобретение.СуммаДокумента;
		КонецЦикла;
		Объект.Вес = ИтогВес;
		Объект.Объем = ИтогОбъем;
		Объект.Стоимость = Стоимость;
		Документы.РейсСиламиПоставщика.ЗаполнитьГруппуПоставки(Объект);

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЗ.ДатаРазгрузки КАК ДатаРазгрузки
			|ПОМЕСТИТЬ ВТГруппаПоставки
			|ИЗ
			|	&ТЗ КАК ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МИНИМУМ(ВТГруппаПоставки.ДатаРазгрузки) КАК ДатаРазгрузки
			|ИЗ
			|	ВТГруппаПоставки КАК ВТГруппаПоставки";
		
		Запрос.УстановитьПараметр("ТЗ", Объект.ГруппаПоставки.Выгрузить());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Объект.ДатаПрибытияНаСклад = ВыборкаДетальныеЗаписи.ДатаРазгрузки;
		КонецЕсли; 
	Исключение       
		Сообщить("Не удалось создать документ");
	КонецПопытки;
	
	//ТЗОснований= Объект.Основания.Выгрузить();
	//
	//Для Каждого Основание Из мОснований Цикл
	//	НоваяСтрока= ТЗОснований.Найти(Основание, "Документ");
	//	Если НоваяСтрока= Неопределено Тогда 
	//		Рейс= НайтиРейсПоЗаказу(Основание);
	//		Если ЗначениеЗаполнено(Рейс) Тогда
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(""+Основание+" присутствует в : "+Рейс);
	//			Продолжить;
	//		КонецЕсли;
	//		НоваяСтрока= Объект.Основания.Добавить();
	//		НоваяСтрока.Документ= Основание;
	//	КонецЕсли;
	//КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор= Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ОбновитьИтогиПоОснованиям(Объект);
	ЗаполнитьВесОбъемОснований(Объект);
КонецПроцедуры	
Процедура ОбновитьИтогиПоОснованиям(Объект) Экспорт
	мСсылок = Объект.Основания.Выгрузить( , "Документ").ВыгрузитьКолонку(0);
	Если ЗначениеЗаполнено(мСсылок) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ЗаказПоставщику.СуммаДокумента) КАК Стоимость,
			|	СУММА(ЗаказПоставщику.ВесПоставки) КАК Вес,
			|	СУММА(ЗаказПоставщику.ОбъемПоставки) КАК Объем
			|ИЗ
			|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
			|ГДЕ
			|	ЗаказПоставщику.Ссылка В(&ДокументыМассив)";
		
		Запрос.УстановитьПараметр("ДокументыМассив", мСсылок);	
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Если РезультатЗапроса.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Объект, РезультатЗапроса);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СозданиеНаОсновании
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	ИмяДокумента= "РейсСиламиПоставщика";
	Если ПравоДоступа("Добавление", Метаданные.Документы[ИмяДокумента]) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы[ИмяДокумента].ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы[ИмяДокумента]);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции
#КонецОбласти

#Область Проверки
Функция ПроверитьПрисутствиеЗаказовВДругихРейсах(Рейс) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РейсСиламиПоставщикаОснования.Ссылка КАК Рейс,
	|	РейсСиламиПоставщикаОснования.Документ КАК Заказ
	|ПОМЕСТИТЬ Заказы
	|ИЗ
	|	Документ.РейсСиламиПоставщика.Основания КАК РейсСиламиПоставщикаОснования
	|ГДЕ
	|	РейсСиламиПоставщикаОснования.Ссылка.Проведен
	|	И РейсСиламиПоставщикаОснования.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РейсСиламиПоставщикаОснования.Ссылка КАК Рейс,
	|	РейсСиламиПоставщикаОснования.Документ КАК Заказ
	|ИЗ
	|	Документ.РейсСиламиПоставщика.Основания КАК РейсСиламиПоставщикаОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Заказы КАК Заказы
	|		ПО РейсСиламиПоставщикаОснования.Документ = Заказы.Заказ
	|			И РейсСиламиПоставщикаОснования.Ссылка <> Заказы.Рейс
	|ГДЕ
	|	РейсСиламиПоставщикаОснования.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Ссылка", Рейс);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка= РезультатЗапроса.Выбрать();
	
	Возврат Выборка
КонецФункции

Функция НайтиРейсПоЗаказу(Заказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РейсСиламиПоставщикаОснования.Ссылка КАК Рейс,
	|	РейсСиламиПоставщикаОснования.Документ КАК Заказ
	|ИЗ
	|	Документ.РейсСиламиПоставщика.Основания КАК РейсСиламиПоставщикаОснования
	|ГДЕ
	|	РейсСиламиПоставщикаОснования.Ссылка.Проведен
	|	И РейсСиламиПоставщикаОснования.Документ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Рейс;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

Функция ПолучитьСписокЗаказовПоставщикуИПриобретений(СписокВыделенныхЗаказов)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокЗаказПоставщику.Ссылка КАК ЗаказПоставщику,
		|	ПриобретениеТоваровУслуг.Ссылка КАК Приобретение,
		|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ПриобретениеТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	&ТекстЗапросаВесНоменклатуры КАК Вес,
		|	&ТекстЗапросаОбъемНоменклатуры КАК Объем
		|ПОМЕСТИТЬ ВТНоменклатураДокумента
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|			ПО ПриобретениеТоваровУслуг.Ссылка = ПриобретениеТоваровУслугТовары.Ссылка
		|		ПО ПриобретениеТоваровУслуг.ЗаказПоставщику = ДокЗаказПоставщику.Ссылка
		|ГДЕ
		|	ДокЗаказПоставщику.Ссылка В(&СписокВыделенныхЗаказов);
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНоменклатураДокумента.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ВТНоменклатураДокумента.Приобретение КАК Приобретение,
		|	СУММА(ВТНоменклатураДокумента.Вес) КАК Вес,
		|	СУММА(ВТНоменклатураДокумента.Объем) КАК Объем
		|ИЗ
		|	ВТНоменклатураДокумента КАК ВТНоменклатураДокумента
		|СГРУППИРОВАТЬ ПО
		|	ВТНоменклатураДокумента.ЗаказПоставщику,
		|	ВТНоменклатураДокумента.Приобретение";
	
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаВесНоменклатуры",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"ПриобретениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения",
	"ПриобретениеТоваровУслугТовары.Номенклатура"));
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаОбъемНоменклатуры",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
	"ПриобретениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения",
	"ПриобретениеТоваровУслугТовары.Номенклатура"));
	
	Запрос.УстановитьПараметр("СписокВыделенныхЗаказов", СписокВыделенныхЗаказов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПроверитьНаличиеЗаказаВДругихРейсах(СписокЗаказовПоставщику, ИтоговаяТЗ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриобретениеТоваровУслуг.Ссылка КАК Приобретение,
		|	ДокЗаказПоставщику.Ссылка КАК Заказ
		|ПОМЕСТИТЬ ВТЗаказыИПриобретения
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|		ПО (ПриобретениеТоваровУслуг.ЗаказПоставщику = ДокЗаказПоставщику.Ссылка)
		|ГДЕ
		|	ДокЗаказПоставщику.Ссылка В(&ВыбранныеЗаказы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗаказыИПриобретения.Заказ КАК Заказ,
		|	ВТЗаказыИПриобретения.Приобретение КАК Приобретение,
		|	РейсСиламиПоставщикаОснования.Ссылка КАК Рейс
		|ИЗ
		|	ВТЗаказыИПриобретения КАК ВТЗаказыИПриобретения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РейсСиламиПоставщика.Основания КАК РейсСиламиПоставщикаОснования
		|		ПО ВТЗаказыИПриобретения.Заказ = РейсСиламиПоставщикаОснования.Документ
		|			И ВТЗаказыИПриобретения.Приобретение = РейсСиламиПоставщикаОснования.Приобретение
		|ГДЕ
		|	РейсСиламиПоставщикаОснования.Ссылка.Проведен
		|	И НЕ РейсСиламиПоставщикаОснования.Ссылка.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТЗаказыИПриобретения.Заказ,
		|	ВТЗаказыИПриобретения.Приобретение,
		|	РейсОтПоставщикаРасчетДоставки.Ссылка
		|ИЗ
		|	ВТЗаказыИПриобретения КАК ВТЗаказыИПриобретения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
		|		ПО ВТЗаказыИПриобретения.Заказ = РейсОтПоставщикаРасчетДоставки.ДокументОснование";
	
	Запрос.УстановитьПараметр("ВыбранныеЗаказы", СписокЗаказовПоставщику);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить(Строка(ВыборкаДетальныеЗаписи.Приобретение)+" по "+Строка(ВыборкаДетальныеЗаписи.Заказ)+" уже содержится в документе "+Строка(ВыборкаДетальныеЗаписи.Рейс)+". Данное приобретение не будет учтено при создании рейса");
		ИтоговаяТЗ.Удалить(ИтоговаяТЗ.Найти(ВыборкаДетальныеЗаписи.Приобретение, "Приобретение"));
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьПроездКПП(Основания, ИтоговаяТЗ)
	Для каждого Заказ из Основания Цикл
		ДатыСменыСостоянийПоставки = Альтерра_СеткаПоставок.ПолучитьТекущееСостояниеПоставки(Заказ, Ложь)[0];
		ДатаВремяПрибытияФакт = ДатыСменыСостоянийПоставки.ВремяПрибытие;
		ДатаВремяЗаезда = ДатыСменыСостоянийПоставки.ВремяВъезд;
		ДатаВремяВыезда = ДатыСменыСостоянийПоставки.ВремяВыезд;
		Если ДатаВремяЗаезда<>Дата(1,1,1) ИЛИ ДатаВремяВыезда<>Дата(1,1,1) ИЛИ ДатаВремяПрибытияФакт<>Дата(1,1,1) Тогда
			Сообщить(Строка(Заказ)+" уже проезжал КПП. Заказ не будет добавлен в основания рейса");
			ИтоговаяТЗ.Удалить(ИтоговаяТЗ.Найти(Заказ, "ЗаказПоставщику"));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьНаличиеПриходногоОрдера(Основания, ИтоговаяТЗ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Документ КАК Документ,
		|	ТЧ.Приобретение КАК Приобретение
		|ПОМЕСТИТЬ ВТОснованияДокумента
		|ИЗ
		|	&ОснованияДокумента КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОснованияДокумента.Документ КАК Основание,
		|	ПриходныйОрдерНаТовары.Ссылка КАК Приходный
		|ИЗ
		|	ВТОснованияДокумента КАК ВТОснованияДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|		ПО ВТОснованияДокумента.Документ = ПриходныйОрдерНаТовары.Распоряжение.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТОснованияДокумента.Приобретение,
		|	ПриходныйОрдерНаТовары.Ссылка
		|ИЗ
		|	ВТОснованияДокумента КАК ВТОснованияДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|		ПО ВТОснованияДокумента.Приобретение = ПриходныйОрдерНаТовары.Распоряжение.Ссылка";
	
	Запрос.УстановитьПараметр("ОснованияДокумента", Основания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТипЗНЧ(ВыборкаДетальныеЗаписи.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Сообщить("По документу "+Строка(ВыборкаДетальныеЗаписи.Основание)+" уже создан приходный ордер. Заказ не будет добавлен в основания.");
			ИтоговаяТЗ.Удалить(ИтоговаяТЗ.Найти(ВыборкаДетальныеЗаписи.Основание, "ЗаказПоставщику"));			
		Иначе
			Сообщить("По документу "+Строка(ВыборкаДетальныеЗаписи.Основание)+" уже создан приходный ордер. Приобретение не будет добавлено в основания.");
			ИтоговаяТЗ.Удалить(ИтоговаяТЗ.Найти(ВыборкаДетальныеЗаписи.Основание, "Приобретение"));	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

Функция ПолучитьТекстЗапросаВесОбъем() Экспорт
	Возврат "ВЫБРАТЬ
		|	ТЗ.Приобретение КАК ДокументОснование
		|ПОМЕСТИТЬ ВТОснованияРейса
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ПриобретениеТоваровУслугТовары.Ссылка КАК Приобретение,
		|	ПриобретениеТоваровУслугТовары.Упаковка КАК Упаковка,
		|	ПриобретениеТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	ВТОснованияРейса КАК ВТОснованияРейса
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|		ПО (ВТОснованияРейса.ДокументОснование = ПриобретениеТоваровУслугТовары.Ссылка)";
КонецФункции

Функция ПолучитьДанныеПоСкладамИСекциям(Объект, Склад = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаВесОбъем();
	Запрос.Текст = Запрос.Текст+
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Номенклатура КАК Номенклатура,
		|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВЫБОР
		|		КОГДА втТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА спрНоменклатура.ЕдиницаИзмерения
		|		ИНАЧЕ втТовары.Упаковка
		|	КОНЕЦ КАК Упаковка,
		|	спрНоменклатура.ВесЕдиницаИзмерения КАК НоменклатураВесЕдиницаИзмерения,
		|	спрНоменклатура.ОбъемЕдиницаИзмерения КАК НоменклатураОбъемЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА спрНоменклатура.ВесЗнаменатель <> 0
		|			ТОГДА спрНоменклатура.ВесЧислитель / спрНоменклатура.ВесЗнаменатель
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВесКоэффициентНоменклатура,
		|	ВЫБОР
		|		КОГДА спрНоменклатура.ОбъемЗнаменатель <> 0
		|			ТОГДА спрНоменклатура.ОбъемЧислитель / спрНоменклатура.ОбъемЗнаменатель
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОбъемКоэффициентНоменклатура,
		|	ПриобретениеТоваровУслуг.Склад КАК Склад
		|ПОМЕСТИТЬ втНоменклатураДокумента
		|ИЗ
		|	втТовары КАК втТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
		|		ПО (втТовары.Номенклатура = спрНоменклатура.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|		ПО (втТовары.Приобретение = ПриобретениеТоваровУслуг.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втНоменклатураДокумента.Номенклатура КАК Номенклатура,
		|	СкладскиеЯчейки.РабочийУчасток КАК Секция,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад КАК Склад
		|ПОМЕСТИТЬ втНоменклатураПоСекциям
		|ИЗ
		|	втНоменклатураДокумента КАК втНоменклатураДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
		|			ПО (РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка = СкладскиеЯчейки.Ссылка)
		|		ПО (втНоменклатураДокумента.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
		|			И втНоменклатураДокумента.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад)
		|ГДЕ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА
		|	И ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Секция КАК Секция,
		|	Итог.ОбъемПоСекции КАК ОбъемПоСекции,
		|	Итог.Склад КАК Склад,
		|	СУММА(Итог.ОбъемПоСекции) КАК ОбъемПоставки,
		|	СУММА(Итог.ВесПоСекции) КАК ВесПоставки
		|ИЗ
		|	(ВЫБРАТЬ
		|		втНоменклатураПоСекциям.Секция КАК Секция,
		|		СУММА(втНоменклатураДокумента.КоличествоУпаковок * втНоменклатураДокумента.ОбъемКоэффициентНоменклатура) КАК ОбъемПоСекции,
		|		СУММА(втНоменклатураДокумента.КоличествоУпаковок * втНоменклатураДокумента.ВесКоэффициентНоменклатура) КАК ВесПоСекции,
		|		втНоменклатураПоСекциям.Склад КАК Склад
		|	ИЗ
		|		втНоменклатураДокумента КАК втНоменклатураДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ втНоменклатураПоСекциям КАК втНоменклатураПоСекциям
		|			ПО втНоменклатураДокумента.Номенклатура = втНоменклатураПоСекциям.Номенклатура
		|	ГДЕ
		|		НЕ втНоменклатураПоСекциям.Секция ЕСТЬ NULL
		|	
		|	СГРУППИРОВАТЬ ПО
		|		втНоменклатураПоСекциям.Секция,
		|		втНоменклатураПоСекциям.Склад) КАК Итог
		|
		|СГРУППИРОВАТЬ ПО
		|	Итог.Секция,
		|	Итог.ОбъемПоСекции,
		|	Итог.Склад
		|ИТОГИ
		|	МАКСИМУМ(ОбъемПоСекции),
		|	СУММА(ОбъемПоставки),
		|	СУММА(ВесПоставки)
		|ПО
		|	Склад";
	Запрос.УстановитьПараметр("ТЗ", Объект.Основания.Выгрузить());
	
	Если Склад <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСкладу", "РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад В(&Склад)");
		Запрос.УстановитьПараметр("Склад", Склад);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСкладу", "Истина");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатЗапроса;
КонецФункции

Процедура ЗаполнитьГруппуПоставки(Объект) Экспорт
	Объект.ГруппаПоставки.Очистить();

	РезультатЗапроса = ПолучитьДанныеПоСкладамИСекциям(Объект);
	
	ВыборкаИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИтог.Следующий() Цикл
	
		Выборка = ВыборкаИтог.Выбрать();
	 	СтрокиТекущегоСклада = Объект.ГруппаПоставки.НайтиСтроки(Новый Структура("Склад", ВыборкаИтог.Склад));
		Если СтрокиТекущегоСклада.Количество() <> 0 Тогда
			СтрокаТекущегоСклада = СтрокиТекущегоСклада[0];
			СтрокаТекущегоСклада.ОбъемПоставки=ВыборкаИтог.ОбъемПоставки;
			СтрокаТекущегоСклада.ВесПоставки=ВыборкаИтог.ВесПоставки;
		Иначе
			СтрокаТекущегоСклада = Объект.ГруппаПоставки.Добавить();
			СтрокаТекущегоСклада.Склад=ВыборкаИтог.Склад;
			СтрокаТекущегоСклада.ОбъемПоставки=ВыборкаИтог.ОбъемПоставки;
			СтрокаТекущегоСклада.ВесПоставки=ВыборкаИтог.ВесПоставки;
		КонецЕсли;
		
		СтрокаТекущегоСклада.ПримечаниеКПоставке = ПолучитьПримечаниеПоСкладу(ВыборкаИтог.Склад, Объект.Основания.Выгрузить());
		СтрокаТекущегоСклада.ДатаРазгрузки = ПолучитьМинимальнуюДатуПоЗаказамПоставщика(Объект.Основания.Выгрузить());
	 	
		Пока Выборка.Следующий() Цикл
			Если ВыборкаИтог.ОбъемПоСекции = Выборка.ОбъемПоСекции Тогда
				СтрокаТекущегоСклада.Секция = Выборка.Секция;
				Норматив = Справочники.НормативыПриемкиПоставкиНаСклад.НайтиПоКоду("000000093");//Заменить на созданный норматив
				СтрокаТекущегоСклада.Норматив = Норматив;
				//СтрокаТекущегоСклада.ПродолжительностьРазгрузки = Норматив.Норматив*ВыборкаИтог.ОбъемПоСекции;//Пересчитать время для нового норматива
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Документы.РейсСиламиПоставщика.ЗаполнитьПоНормативу(Объект);
	
	ПолучитьДанныеПоГрафику(Объект);
	
КонецПроцедуры

Функция ПолучитьПримечаниеПоСкладу(Склад, ОснованияРейса)
	КомментарийПоСкладу = "";
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЗ.Документ КАК ДокументОснование
		|ПОМЕСТИТЬ ВТОснованияРейса
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПоставщику.Комментарий КАК Комментарий
		|ИЗ
		|	ВТОснованияРейса КАК ВТОснованияРейса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|		ПО ВТОснованияРейса.ДокументОснование = ЗаказПоставщику.Ссылка
		|ГДЕ
		|	ЗаказПоставщику.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ТЗ", ОснованияРейса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КомментарийПоСкладу = КомментарийПоСкладу+Строка(ВыборкаДетальныеЗаписи.Комментарий)+"; ";
	КонецЦикла;
	Возврат КомментарийПоСкладу;
КонецФункции

Функция ПолучитьМинимальнуюДатуПоЗаказамПоставщика(ОснованияРейса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Документ КАК ДокументОснование
		|ПОМЕСТИТЬ ВТОснованияРейса
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПоставщику.ДатаПоступления КАК ДатаПоступления
		|ПОМЕСТИТЬ ВТДатыЗаказов
		|ИЗ
		|	ВТОснованияРейса КАК ВТОснованияРейса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|		ПО ВТОснованияРейса.ДокументОснование = ЗаказПоставщику.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТДатыЗаказов.ДатаПоступления) КАК ДатаРазгрузки
		|ИЗ
		|	ВТДатыЗаказов КАК ВТДатыЗаказов";
	
	Запрос.УстановитьПараметр("ТЗ", ОснованияРейса);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ДатаРазгрузки;
	КонецЕсли;
	
	Возврат Дата(1,1,1);

КонецФункции

Процедура ПолучитьДанныеПоГрафику(Объект)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Выбор
		|		когда ГрафикПоставокНаСкладСрезПоследних.Оборудование = Значение(Справочник.ТехническиеРесурсыСклада.ПустаяСсылка)
		|			Тогда Ложь
		|		Иначе Истина
		|	конец КАК Оборудование,
		|	ГрафикПоставокНаСкладСрезПоследних.Склад КАК Склад,
		|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК ДатаВремяРазгрузкиПлан,
		|	ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки КАК ПродолжительностьРазгрузки
		|ИЗ
		|	РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних КАК ГрафикПоставокНаСкладСрезПоследних
		|ГДЕ
		|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику = &ЗаказПоставщику";
	
	Запрос.УстановитьПараметр("ЗаказПоставщику", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокиТекущегоСклада = Объект.ГруппаПоставки.НайтиСтроки(Новый Структура("Склад", ВыборкаДетальныеЗаписи.Склад));
		Если СтрокиТекущегоСклада.Количество() > 0 Тогда
			ТекущаяСтрока = СтрокиТекущегоСклада[0];
			ТекущаяСтрока.Эстакада = ВыборкаДетальныеЗаписи.Оборудование;
			ТекущаяСтрока.ДатаРазгрузки = ВыборкаДетальныеЗаписи.ДатаВремяРазгрузкиПлан;
			ТекущаяСтрока.ВремяПоступления = ВыборкаДетальныеЗаписи.ДатаВремяРазгрузкиПлан;
			ТекущаяСтрока.ПродолжительностьРазгрузки = ВыборкаДетальныеЗаписи.ПродолжительностьРазгрузки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьВесОбъемОснований(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка,
		|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ПриобретениеТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	&ТекстЗапросаВесНоменклатуры КАК Вес,
		|	&ТекстЗапросаОбъемНоменклатуры КАК Объем
		|ПОМЕСТИТЬ ВТНоменклатураДокумента
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|ГДЕ
		|	ПриобретениеТоваровУслугТовары.Ссылка В (&Основания)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНоменклатураДокумента.Ссылка КАК Ссылка,
		|	СУММА(ВТНоменклатураДокумента.Вес) КАК Вес,
		|	СУММА(ВТНоменклатураДокумента.Объем) КАК Объем
		|ИЗ
		|	ВТНоменклатураДокумента КАК ВТНоменклатураДокумента
		|СГРУППИРОВАТЬ ПО
		|	ВТНоменклатураДокумента.Ссылка";
	
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаВесНоменклатуры",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"ПриобретениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения",
	"ПриобретениеТоваровУслугТовары.Номенклатура"));
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаОбъемНоменклатуры",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
	"ПриобретениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения",
	"ПриобретениеТоваровУслугТовары.Номенклатура"));
	
	Основания = Новый Массив;
	Для каждого Строка из Объект.Основания Цикл
		Основания.Добавить(Строка.Приобретение);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Основания", Основания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НайденныеСтроки = Объект.Основания.НайтиСтроки(Новый структура("Приобретение", ВыборкаДетальныеЗаписи.Ссылка));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТекущаяСтрока = НайденныеСтроки[0];
			ТекущаяСтрока.Вес = ВыборкаДетальныеЗаписи.Вес; 
			ТекущаяСтрока.Объем = ВыборкаДетальныеЗаписи.Объем; 
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Процедура ОбновитьВремяИИнтервалПоставки(Объект) Экспорт
	
	МассивСкладов = Новый Массив;
	Для каждого Строка из Объект.ГруппаПоставки Цикл
		МассивСкладов.Добавить(Строка.Склад);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ГрафикПоставокНаСкладСрезПоследних.Оборудование КАК Оборудование,
		|	ГрафикПоставокНаСкладСрезПоследних.Поток КАК Поток,
		|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК ДатаВремяРазгрузкиПлан,
		|	ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки КАК ПродолжительностьРазгрузки,
		|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция.Владелец КАК Склад,
		|	ГрафикПоставокНаСкладСрезПоследних.ТекстПоставки КАК ТекстПоставки, 
		|	ГрафикПоставокНаСкладСрезПоследних.СогласованоСоСкладом КАК СогласованоСоСкладом
		|ИЗ
		|	РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних КАК ГрафикПоставокНаСкладСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.Секции КАК ПотокиТранспортныхСредствПоставкиНаСкладСекции
		|		ПО ГрафикПоставокНаСкладСрезПоследних.Поток = ПотокиТранспортныхСредствПоставкиНаСкладСекции.Ссылка
		|ГДЕ
		|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция.Владелец В(&Склад)
		|	И ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику = &Рейс 
		|ИТОГИ ПО
		|	Склад";
	
	Запрос.УстановитьПараметр("Склад", МассивСкладов);//
	Запрос.УстановитьПараметр("Рейс", Объект.Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаСклад = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСклад.Следующий() Цикл
		ТекущиеСтроки = Объект.ГруппаПоставки.НайтиСтроки(Новый Структура("Склад", ВыборкаСклад.Склад));
		ВыборкаДетальныеЗаписи = ВыборкаСклад.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ТекущиеСтроки.Количество() > 0 Тогда
				ТекущаяСтрока = ТекущиеСтроки[0];
				ТекущаяСтрока.ДатаРазгрузки = ВыборкаДетальныеЗаписи.ДатаВремяРазгрузкиПлан;
				ТекущаяСтрока.ПродолжительностьРазгрузки = ВыборкаДетальныеЗаписи.ПродолжительностьРазгрузки;
				ТекущаяСтрока.ВремяПоступления = ВыборкаДетальныеЗаписи.ДатаВремяРазгрузкиПлан;
				ТекущаяСтрока.Поток = ВыборкаДетальныеЗаписи.Поток;
				ТекущаяСтрока.Эстакада = ?(ТекущаяСтрока.Эстакада, Истина, ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Оборудование));
				ТекущаяСтрока.СогласованоСоСкладом = ВыборкаДетальныеЗаписи.СогласованоСоСкладом;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоНормативу(Объект, РучнойПересчет=Ложь, ТЗСкладИНорматив = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ТЗНормативы.Склад КАК Склад,
		|	ТЗНормативы.Норматив КАК Норматив
		|ПОМЕСТИТЬ ВТНормативыПоСкладу
		|ИЗ
		|	&ТЗНормативы КАК ТЗНормативы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ.Документ КАК ДокументОснование
		|ПОМЕСТИТЬ ВТОснованияРейса
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПеремещениеТоваровТовары.Ссылка КАК Перемещение,
		|	ПеремещениеТоваровТовары.Упаковка КАК Упаковка,
		|	ПеремещениеТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТНормативыПоСкладу.Норматив КАК Норматив
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОснованияРейса КАК ВТОснованияРейса
		|		ПО (ВТОснованияРейса.ДокументОснование = ЗаказНаДоставкуКлиентуОснования.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНормативыПоСкладу КАК ВТНормативыПоСкладу
		|			ПО ВТНормативыПоСкладу.Склад = ПеремещениеТоваровТовары.Ссылка.СкладПолучатель
		|		ПО (ЗаказНаДоставкуКлиентуОснования.Документ = ПеремещениеТоваровТовары.Ссылка) 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Перемещение КАК Перемещение,
		|	втТовары.Номенклатура КАК Номенклатура,
		|	втТовары.Перемещение.СкладПолучатель КАК Склад,
		|	втТовары.Норматив КАК Норматив,
		|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВЫБОР
		|		КОГДА втТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА спрНоменклатура.ЕдиницаИзмерения
		|		ИНАЧЕ втТовары.Упаковка
		|	КОНЕЦ КАК Упаковка,
		|	спрНоменклатура.ВесЕдиницаИзмерения КАК НоменклатураВесЕдиницаИзмерения,
		|	спрНоменклатура.ОбъемЕдиницаИзмерения КАК НоменклатураОбъемЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА спрНоменклатура.ВесЗнаменатель <> 0
		|			ТОГДА спрНоменклатура.ВесЧислитель / спрНоменклатура.ВесЗнаменатель
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВесКоэффициентНоменклатура,
		|	ВЫБОР
		|		КОГДА спрНоменклатура.ОбъемЗнаменатель <> 0
		|			ТОГДА спрНоменклатура.ОбъемЧислитель / спрНоменклатура.ОбъемЗнаменатель
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОбъемКоэффициентНоменклатура
		|ПОМЕСТИТЬ втНоменклатураДокумента
		|ИЗ
		|	втТовары КАК втТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
		|		ПО втТовары.Номенклатура = спрНоменклатура.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втНоменклатураДокумента.Номенклатура КАК Номенклатура,
		|	втНоменклатураДокумента.Упаковка КАК Упаковка,
		|	втНоменклатураДокумента.КоличествоУпаковок КАК КоличествоУпаковок,
		|	втНоменклатураДокумента.Перемещение КАК Ссылка,
		|	втНоменклатураДокумента.Склад КАК Склад,      
		|	ВЫБОР
		|		КОГДА НормативыПриемкиПоставкиНаСклад.ЕдИзмеренияЗнаменателя.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
		|			ТОГДА втНоменклатураДокумента.НоменклатураВесЕдиницаИзмерения
		|		ИНАЧЕ втНоменклатураДокумента.НоменклатураОбъемЕдиницаИзмерения
		|	КОНЕЦ КАК НоменклатураЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА НормативыПриемкиПоставкиНаСклад.ЕдИзмеренияЗнаменателя.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
		|			ТОГДА втНоменклатураДокумента.ВесКоэффициентНоменклатура
		|		ИНАЧЕ втНоменклатураДокумента.ОбъемКоэффициентНоменклатура
		|	КОНЕЦ КАК НоменклатураКоэффициент,
		|	НормативыПриемкиПоставкиНаСклад.Норматив КАК Норматив,
		|	НормативыПриемкиПоставкиНаСклад.ЕдИзмеренияЗнаменателя КАК ЕдИзмеренияЗнаменателя,
		|	НормативыПриемкиПоставкиНаСклад.МинимальноеВремя КАК МинимальноеВремя,
		|	НормативыПриемкиПоставкиНаСклад.МаксимальноеВремя КАК МаксимальноеВремя
		|ПОМЕСТИТЬ втИтогДляВремени
		|ИЗ
		|	Справочник.НормативыПриемкиПоставкиНаСклад КАК НормативыПриемкиПоставкиНаСклад
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНоменклатураДокумента КАК втНоменклатураДокумента   
		|		ПО втНоменклатураДокумента.Норматив = НормативыПриемкиПоставкиНаСклад.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Упаковка КАК Упаковка,
		|	Итог.КоличествоУпаковок КАК КоличествоУпаковок,
		|	Итог.НоменклатураКоэффициент КАК НоменклатураКоэффициент,
		|	Итог.НоменклатураЕдиницаИзмерения.Числитель КАК НоменклатураЕдиницаИзмеренияЧислитель,
		|	Итог.НоменклатураЕдиницаИзмерения.Знаменатель КАК НоменклатураЕдиницаИзмеренияЗнаменатель,
		|	Итог.ЕдИзмеренияЗнаменателя.Числитель КАК ЕдИзмеренияЗнаменателяЧислитель,
		|	Итог.Норматив КАК Норматив,
		|	ЕСТЬNULL(Итог.КоличествоУпаковок * Итог.НоменклатураКоэффициент * Итог.НоменклатураЕдиницаИзмерения.Числитель / Итог.НоменклатураЕдиницаИзмерения.Знаменатель * Итог.ЕдИзмеренияЗнаменателя.Знаменатель / Итог.ЕдИзмеренияЗнаменателя.Числитель * Итог.Норматив, 0) КАК ВремяРассчитанное,
		|	Итог.Ссылка КАК Ссылка,
		|	Итог.Склад КАК Склад,
		|	Итог.МинимальноеВремя КАК МинимальноеВремя,
		|	Итог.МаксимальноеВремя КАК МаксимальноеВремя
		|ИЗ
		|	втИтогДляВремени КАК Итог
		|ИТОГИ
		|	МАКСИМУМ(МинимальноеВремя),
		|	МАКСИМУМ(МаксимальноеВремя)
		|ПО
		|	Склад";
	Запрос.УстановитьПараметр("ТЗ", Объект.Основания.Выгрузить());
	Запрос.УстановитьПараметр("ТЗНормативы", ?(ТЗСкладИНорматив = Неопределено, Объект.ГруппаПоставки.Выгрузить(), ТЗСкладИНорматив));
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВремяРазгрузки = 0;
	Пока ВыборкаИтог.Следующий() Цикл 
		СтрокиТекущегоСклада = Объект.ГруппаПоставки.НайтиСтроки(Новый Структура("Склад", ВыборкаИтог.Склад));
		ВыборкаДетальные = ВыборкаИтог.Выбрать();
		Пока ВыборкаДетальные.Следующий() Цикл
			ВремяРазгрузки = ВремяРазгрузки + ВыборкаДетальные.ВремяРассчитанное;
		КонецЦикла;
		СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки = Мин(Макс(ВремяРазгрузки, ВыборкаИтог.МинимальноеВремя), ВыборкаИтог.МаксимальноеВремя);
		ОкрПродолжительностьРазгрузки = Окр(СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки, -1, РежимОкругления.Окр15как20);
		Если ОкрПродолжительностьРазгрузки < СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки Тогда
			СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки = ОкрПродолжительностьРазгрузки+5;
		Иначе
			СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки = ОкрПродолжительностьРазгрузки;
		КонецЕсли;
	
		Если СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки = 0 Тогда
			СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки = СтрокиТекущегоСклада[0].Норматив.МинимальноеВремя;
		КонецЕсли;
	КонецЦикла;	
	
	Модифицированность = Истина;
	
КонецПроцедуры // ЗаполнитьПоНормативу()

Функция УдалитьЗаписиВГрафикеПоставокНаСклад(Ссылка, Склад = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикПоставокНаСклад.ЗаказПоставщику КАК ЗаказПоставщику
		|ИЗ
		|	РегистрСведений.ГрафикПоставокНаСклад КАК ГрафикПоставокНаСклад
		|ГДЕ
		|	ГрафикПоставокНаСклад.ЗаказПоставщику = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НаборЗаписейГрафикаПоставок = РегистрыСведений.ГрафикПоставокНаСклад.СоздатьНаборЗаписей();
		
		НаборЗаписейГрафикаПоставок.Отбор.ЗаказПоставщику.Установить(ВыборкаДетальныеЗаписи.ЗаказПоставщику);
		Если Склад <> Неопределено Тогда
			НаборЗаписейГрафикаПоставок.Отбор.Склад.Установить(Склад);
		КонецЕсли;
		
		НаборЗаписейГрафикаПоставок.Прочитать();
		Для каждого Запись из НаборЗаписейГрафикаПоставок Цикл
			Запись.ДатаВремяРазгрузкиПлан = НачалоДня(Запись.ДатаВремяРазгрузкиПлан);
		КонецЦикла;
		
		НаборЗаписейГрафикаПоставок.Записать();
	КонецЕсли;
	
КонецФункции
#КонецЕсли
